{
  "status": "success",
  "totalResults": 2271,
  "results": [
    {
      "title": "Twitter Down? Netizens face problem in accessing feed page, web users affected",
      "link": "https://zeenews.india.com/technology/twitter-down-netizens-face-problem-in-accessing-feed-page-web-users-affected-2530773.html",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "When the feed page initially loads, a popup with the message \"Something Went Wrong, But Don't Worry - Try Again\" displays.",
      "content": null,
      "pubDate": "2022-11-04 03:11:00",
      "image_url": null,
      "source_id": "zeenews",
      "country": ["india"],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "US chip-gear makers told to wait for relief from China curbs",
      "link": "https://www.scmp.com/tech/tech-war/article/3198382/us-chip-gear-makers-told-wait-relief-china-curbs?utm_source=rss_feed",
      "keywords": null,
      "creator": ["Bloomberg"],
      "video_url": null,
      "description": "US makers of chip-making tools may need to wait as long as nine months before Washington can reach an accord with allies over strict new rules aimed at restricting China’s access to certain technologies.",
      "content": null,
      "pubDate": "2022-11-04 03:00:22",
      "image_url": "https://cdn.i-scmp.com/sites/default/files/styles/1280x720/public/d8/images/canvas/2022/11/04/def1b935-fb9d-473a-825f-fddeb17fee1b_eb818f29.jpg?itok=5i8mopUs",
      "source_id": "scmp",
      "country": ["china"],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "Alibaba Cloud plans for a fifth of its servers to use homebrew Arm CPUs by 2025",
      "link": "https://go.theregister.com/feed/www.theregister.com/2022/11/04/alibaba_cloud_20_percent_arm/",
      "keywords": null,
      "creator": ["Simon Sharwood"],
      "video_url": null,
      "description": "Sanctions? What sanctions? Just look at the low, low, power consumption figures Alibaba Cloud has revealed that it plans to power 20 percent of its operations with its own homebrew CPUs by 2025.…",
      "content": null,
      "pubDate": "2022-11-04 02:59:06",
      "image_url": null,
      "source_id": "theregister",
      "country": ["nigeria"],
      "category": ["technology", "science"],
      "language": "english"
    },
    {
      "title": "What's next for the Matter smart home",
      "link": "https://appleinsider.com/articles/22/11/04/whats-next-for-the-matter-smart-home?utm_medium=rss",
      "keywords": null,
      "creator": ["news@appleinsider.com (Andrew O'Hara)"],
      "video_url": null,
      "description": "This week Matter finally became official with the announcement of many launch devices and additional information on the future of the unifying smart home standard.Matter is upon usThe Connectivity Standards Alliance gathered the media in Amsterdam, revealing new information about its future roadmap and highlighting devices from many partner brands. Read more...",
      "content": null,
      "pubDate": "2022-11-04 02:53:18",
      "image_url": null,
      "source_id": "appleinsider",
      "country": [
        "united states of america",
        "united kingdom",
        "india",
        "australia",
        "singapore",
        "canada"
      ],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "Twitter down for some users, unable to login on the website",
      "link": "https://timesofindia.indiatimes.com/gadgets-news/twitter-down-for-some-users-unable-to-login-on-the-website/articleshow/95289398.cms",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "“Something went wrong but don’t fret — let’s give it another shot” is the message which pops up when a few users try to log in to Twitter.",
      "content": null,
      "pubDate": "2022-11-04 02:51:58",
      "image_url": null,
      "source_id": "toi",
      "country": ["india"],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "What Elon Musk told this actor from Pakistan on changing Twitter's algorithm",
      "link": "https://timesofindia.indiatimes.com/gadgets-news/what-elon-musk-told-this-actor-from-pakistan-on-changing-twitters-algorithm/articleshow/95289326.cms",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Pakistani actor-singer Ali Zafar has a suggestion for Twitter's new owner Elon Musk. Zafar, who has 3.2 million followers, wrote that Twitter should build profile ratings based on the quality of people's tweets. He further suggested that Twitter should change the algorithm so that a person in the US is able to see content being made in Japan more easily and vice versa. Zafar gave these recommendations in response to Musk's tweet asking his followers if Twitter should bring back Vine. For those unaware, Vine was Twitter's short video platform that the company shut down in 2016. Musk also asked people: What could we do to make it better than TikTok?",
      "content": null,
      "pubDate": "2022-11-04 02:50:27",
      "image_url": null,
      "source_id": "toi",
      "country": ["india"],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "Opendoor cuts 500-plus jobs: Read CEO and co-founder Eric Wu's email to employees",
      "link": "https://timesofindia.indiatimes.com/gadgets-news/opendoor-cuts-500-plus-jobs-read-ceo-and-co-founder-eric-wus-email-to-employees/articleshow/95289183.cms",
      "keywords": null,
      "creator": null,
      "video_url": null,
      "description": "Opendoor is letting go of about 550 people across all functions. The company's chief executive and co-founder Eric Wu announced the job cuts in a blog post, noting that about 18% of the company's workforce would be affected. The company had already scaled back over 830 positions earlier this year, primarily through a reduction in third-party resourcing, and eliminated \"millions of fixed expenses,\" according to Wu. The San Francisco-based Opendoor has been viewed as a changing force in the US residential real estate market. The company uses an algorithm to price homes, offers to purchase the properties with cash, makes necessary repairs and then resells the homes.",
      "content": null,
      "pubDate": "2022-11-04 02:46:23",
      "image_url": null,
      "source_id": "toi",
      "country": ["india"],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "An Antarctic neutrino telescope has detected a signal from the heart of a nearby active galaxy",
      "link": "https://theconversation.com/an-antarctic-neutrino-telescope-has-detected-a-signal-from-the-heart-of-a-nearby-active-galaxy-193845",
      "keywords": null,
      "creator": [
        "Gary Hill",
        " Associate Professor",
        " Astrophysics and Dark Matter Researcher",
        " University of Adelaide"
      ],
      "video_url": null,
      "description": null,
      "content": "An enormous neutrino observatory buried deep in the Antarctic ice has discovered only the second extra-galactic source of the elusive particles ever found. In results published today in Science , the IceCube collaboration reports the detection of neutrinos from an “active galaxy” called NGC 1068, which lies some 47 million light-years from Earth. Neutrinos are very shy fundamental particles that don’t often interact with anything else. When they were first detected in the 1950s, physicists soon realised they would in some ways be ideal for astronomy. Because neutrinos so rarely have anything to do with other particles, they can travel unimpeded across the Universe. However, their shyness also makes them difficult to detect. To catch enough to be useful, you need a very big detector. That’s where IceCube comes in. Over the course of seven summers from 2005 to 2011, scientists at America’s Amundsen–Scott South Pole Station bored 86 holes in the ice with a hot-water drill. Each hole is almost 2.5 kilometres deep, about 60 centimetres wide, and contains 60 basketball-sized light detectors attached to a long stretch of cable. How does this help us detect neutrinos? Occasionally, a neutrino will bump into a proton or neutron in the ice near a detector. The collision produces a much heavier particle called a muon, travelling so fast it emits a blue glow, which the light detectors can pick up. By measuring when this light arrives at different detectors, the direction the muon (and neutrino) came from can be calculated. Looking at the particle energies, it turns out most of the neutrinos IceCube detects are created in Earth’s atmosphere. Read more: Spotting astrophysical neutrinos is just the tip of the IceCube However, a small fraction of the neutrinos do come from outer space. As of 2022, thousands of neutrinos from somewhere in the distant Universe have been identified. They appear to come fairly uniformly from all directions, without any obvious bright spots showing up. This means there must be a lot of sources of neutrinos out there. But what are these sources? There are plenty of candidates, exotic-sounding objects like active galaxies, quasars, blazars and gamma-ray bursts. In 2018, IceCube announced the discovery of the first identified high-energy neutrino emitter – a blazar, which is a particular kind of galaxy that happens to be firing a jet of high-energy particles in Earth’s direction. Read more: Scientists discover a new source of neutrinos in space – opening up another window into the universe Known as TXS 0506+056, the blazar was identified after IceCube saw a single high-energy neutrino and sent out an urgent astronomer’s telegram. Other telescopes scrambled to take a look at TXS 0506+056, and discovered it was also emitting a lot of gamma rays at the same time. This makes sense, because we think blazars work by boosting protons to extreme speeds – and these high-energy protons then interact with other gas and radiation to produce both gamma rays and neutrinos. The blazar was the first extra-galactic source ever discovered. In this new study, IceCube identified the second. The IceCube scientists re-examined the first decade of data they had collected, applying fancy new methods to pull out sharper measurements of neutrino directions and energy. As a result, an already interesting bright spot in the background neutrino glow came into sharper focus. About 80 neutrinos had come from a fairly nearby, well-studied galaxy called NGC 1068 (also known as M77, as it is the 77th entry in the famous 18th-century catalogue of interesting astronomical objects created by the French astronomer Charles Messier). Located about 47 million light-years from Earth, NGC 1068 is a known “active galaxy” – a galaxy with an extremely bright core. It is about 100 times closer than the blazar TXS 0506+056, and its angle relative to us means gamma rays from its core are obscured from our view by dust. However, neutrinos happily zoom straight through the dust and into space. This new discovery will provide a wealth of information to astrophysicists and astronomers about what exactly is going on inside NGC 1068. There are already hundreds of papers attempting to explaining how the galaxy’s inner core works, and the new IceCube data add some information about neutrinos that will help to refine these models.",
      "pubDate": "2022-11-04 02:44:13",
      "image_url": null,
      "source_id": "theconversation",
      "country": ["australia"],
      "category": ["technology", "science"],
      "language": "english"
    },
    {
      "title": "Honor MagicBook X 16 Malaysia: Affordable 16″ laptop powered by 12th gen Intel Core processor",
      "link": "https://soyacincau.com/2022/11/04/honor-magicbook-x-16-malaysia-intel-12th-gen-price-specs-launch/",
      "keywords": [
        "Laptops",
        "News",
        "Tech",
        "Honor",
        "Honor MagicBook",
        "Honor MagicBook 16",
        "Honor MagicBook X 16",
        "Honor MagicBook X 16 Malaysia"
      ],
      "creator": ["Alexander Wong"],
      "video_url": null,
      "description": "If you’re still working from home (WFH) and looking for an affordable large-screen laptop, Honor Malaysia has introduced the MagicBook X 16 for our local market. This new 16″ laptop is priced lower than the MagicBook 16 that was announced earlier this year and it runs on Intel’s 12th gen Core processor. Honor MagicBook X […]",
      "content": "If you’re still working from home (WFH) and looking for an affordable large-screen laptop, Honor Malaysia has introduced the MagicBook X 16 for our local market. This new 16″ laptop is priced lower than the MagicBook 16 that was announced earlier this year and it runs on Intel’s 12th gen Core processor. Honor MagicBook X 16 Malaysia Price and Availability The Honor MagicBook X 16 with 8GB RAM and 512GB storage is officially priced at RM3,499 in Malaysia. It will go on sale from the 18th of November 2022 through Honor’s online store, participating authorised retailers as well as Lazada and Shopee. Honor Malaysia is bundling freebies worth up to RM777 which include an Honor Backpack, Wireless Mouse and pre-installed Microsoft Office Home & Student 2021. The laptop is currently offered in a single Mystic Silver colour option. Honor MagicBook X 16 Specs The Honor MagicBook X 16 gets a 16″ Full HD (1920×1200 pixels) display in a 16:10 aspect ratio. It boasts 4.5mm slim bezels and a screen-to-body ratio of 89%. The screen has a 100% sRGB wide colour gamut and a maximum brightness of 300 nits. Under the hood, it runs on the current generation 12th gen Intel Core i5-1235U processor that features two performance and eight efficiency cores, and a max turbo frequency of 4.4GHz. To keep things cool, the MagicBook X 16 is said to have a jumbo-size fan, dual heat pipes and a 21% larger cooling fin area for efficient cooling. Powering the laptop is a 60Wh battery which Honor claims can last up to 12 hours of 1080p local video playback or 10.5 hours of daily work usage. Unlike the Ryzen-powered MagicBook 16, the keyboard on the MagicBook X 16 has a numeric keypad and it claims to offer expandable storage of up to 1TB. The rest of the specs aren’t revealed yet as Honor has not published its MagicBook X 16 product page on their website. If you prefer a 16″ laptop with more grunt, the Honor MagicBook 16 with a 144Hz 16.1″ display, AMD Ryzen 7 5800H processor, 16GB RAM and 512GB storage is currently going for RM4,299. It is available via Lazada and Shopee. Related reading Vivobook 16X: Asus Malaysia’s affordable 16″ Ryzen 5 laptop, priced under RM3,000 Acer Swift Edge: This 16″ 4K OLED laptop is lighter than a MacBook Air M2 Honor MagicBook 16 with an AMD Ryzen 7 and 144Hz display now in Malaysia for RM4,299",
      "pubDate": "2022-11-04 02:43:08",
      "image_url": null,
      "source_id": "soyacincau",
      "country": ["malaysia"],
      "category": ["technology"],
      "language": "english"
    },
    {
      "title": "Twitter to start layoffs on Friday, internal email reveals",
      "link": "https://www.digitaltrends.com/social-media/twitter-to-start-layoffs-on-friday-internal-email-reveals/",
      "keywords": ["News", "Social Media", "Elon Musk", "Twitter"],
      "creator": ["Trevor Mogg"],
      "video_url": null,
      "description": "Following days of speculation after Elon Musk’s recent takeover of Twitter, the company is expected to make significant job cuts on Friday.",
      "content": "Following days of speculation after Elon Musk’s recent takeover of Twitter in a $44 billion deal , the company is expected to make significant job cuts on Friday. In a widely reported internal email sent to Twitter employees on Thursday, the company said: “In an effort to place Twitter on a healthy path, we will go through the difficult process of reducing our global workforce on Friday. We recognize that this will impact a number of individuals who have made valuable contributions to Twitter, but this action is unfortunately necessary to ensure the company’s success moving forward.” Staff will find out if they’re keeping their job via email “to inform impacted individuals as quickly as possible,” the message said. Notifications will be sent out by 9 a.m. PT, with all employees receiving an email with the subject line: “Your Role at Twitter. Please check your email, including your spam folder.” It said that if a person’s employment is not impacted, the notification will go to their work account, but if their position has been terminated, it will go to their personal email. “To help ensure the safety of each employee as well as Twitter systems and customer data, our offices will be temporarily closed and all badge access will be suspended,” Twitter’s email said. “If you are in an office or on your way to an office, please return home.” It added: “We acknowledge this is an incredibly challenging experience to go through, whether or not you are impacted. Thank you for continuing to adhere to Twitter policies that prohibit you from discussing confidential company information on social media, with the press or elsewhere. We are grateful for your contributions to Twitter and for your patience as we move through this process.” It’s not clear how many of Twitter’s 7,500 employees globally will lose their position at the company. Reports last month suggested as many as 75% of the staff could be axed, while yesterday insiders suggested the headcount would be reduced by around half. Twitter hopes that by cutting the payroll and by making other changes such as charging users who want to keep their blue verification badges, it can improve the company’s bottom line. But many fear that a drastic reduction in the workforce could lead to more problems as it will have fewer people to grapple with any issues that arise on the platform. One thing is clear, though. The company is currently in a massive state of flux, with staff and users alike unclear as to how things are going to pan out for the platform. With Musk already having fired the CEO and the entire board, and speculation swirling about the kinds of changes that could be coming, it’s likely to be some time before normal service resumes. Editors' Recommendations Twitter reportedly plans to enable Edit Tweet for everyone this week Elon Musk to cut half of Twitter workforce, report says Twitter’s edit button could soon be free for all users Twitter Blue is losing Ad Free Articles and Musk’s latest tweets indicate further changes Elon Musk now Twitter CEO after firing entire board",
      "pubDate": "2022-11-04 02:40:08",
      "image_url": "https://www.digitaltrends.com/wp-content/uploads/2022/05/tweeter-2.jpg?resize=440%2C292&p=1",
      "source_id": "digitaltrends",
      "country": ["ireland"],
      "category": ["technology"],
      "language": "english"
    }
  ],
  "nextPage": 1
}
